Config/Catalogs/SMSTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SMSTemplates</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTextRu</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTextEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTextDe</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLTextRu</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLTextEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLTextDe</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AttachDocumentPrintFormToEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectPrintingFormRu</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ObjectPrintingForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectPrintingFormEn</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ObjectPrintingForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectPrintingFormDe</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ObjectPrintingForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/SMSTemplates/Forms/tcListForm/Ext/Form/Module.bsl
&AtServerNoContext
Procedure ListOnGetDataAtServer(pItemName, pSettings, pRows)
	For Each vRow In pRows Do
		If ValueIsFilled(vRow.Key.Ref) Then
			vRow.Value.Data.Description = tcOnServer.cmNStrAtServer(vRow.Key.Description);
			If Not vRow.Key.Ref.IsFolder And (Not IsBlankString(vRow.Key.SMSTextRu) Or Not IsBlankString(vRow.Key.SMSTextEn) Or Not IsBlankString(vRow.Key.SMSTextDe)) Then
				If SessionParameters.CurrentLanguage = Catalogs.Languages.RU Then
					vRow.Value.Data.SMSText = TrimAll(vRow.Key.SMSTextRu);
					vRow.Value.Data.MessageLength = Format(StrLen(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG="); 
					vRow.Value.Data.NumberOfSMS = Format(SMS.GetNumberOfSegments(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG=");
				ElsIf SessionParameters.CurrentLanguage = Catalogs.Languages.EN Then
					vRow.Value.Data.SMSText = TrimAll(vRow.Key.SMSTextEn);
					vRow.Value.Data.MessageLength = Format(StrLen(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG="); 
					vRow.Value.Data.NumberOfSMS = Format(SMS.GetNumberOfSegments(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG=");					
				ElsIf SessionParameters.CurrentLanguage = Catalogs.Languages.DE Then
					vRow.Value.Data.SMSText = TrimAll(vRow.Key.SMSTextDe);
					vRow.Value.Data.MessageLength = Format(StrLen(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG="); 
					vRow.Value.Data.NumberOfSMS = Format(SMS.GetNumberOfSegments(vRow.Value.Data.SMSText), "ND=10; NFD=0; NG=");					
				EndIf;
			EndIf;
		EndIf;
	EndDo;                                          
EndProcedure
